---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsActualRiserHeightGreaterThanMaximumFailure
source: html/f1edf45c-1221-213b-b6aa-84ac599539e9.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsActualRiserHeightGreaterThanMaximumFailure Property

Computed actual riser height of stairs is greater than maximum riser height defined in stairs type.

## Syntax (C#)
```csharp
public static FailureDefinitionId StairsActualRiserHeightGreaterThanMaximumFailure { get; }
```